experiment-data/k3s/dp_redis_density/dp_redis_density/2022-10-07T13-49-53/kbench-pod-oid-0-tid-0/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          958.05          ---          ---        18.93831        15.48700        96.76700       175.10300        73.80 
Gets         9578.89         1.00      9577.89        18.94799        15.48700        97.27900       174.07900       373.16 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      10536.94         1.00      9577.89        18.94711        15.48700        96.76700       174.07900       446.97 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.239        0.000
SET       2.863        5.000
SET       5.567       10.000
SET       7.423       15.000
SET       8.895       20.000
SET      10.047       25.000
SET      11.135       30.000
SET      12.159       35.000
SET      13.247       40.000
SET      14.335       45.000
SET      15.487       50.000
SET      16.063       52.500
SET      16.767       55.000
SET      17.407       57.500
SET      18.047       60.000
SET      18.815       62.500
SET      19.583       65.000
SET      20.351       67.500
SET      21.119       70.000
SET      22.015       72.500
SET      23.039       75.000
SET      23.551       76.250
SET      24.063       77.500
SET      24.703       78.750
SET      25.343       80.000
SET      25.983       81.250
SET      26.751       82.500
SET      27.519       83.750
SET      28.287       85.000
SET      29.183       86.250
SET      30.207       87.500
SET      30.719       88.125
SET      31.359       88.750
SET      31.999       89.375
SET      32.767       90.000
SET      33.535       90.625
SET      34.303       91.250
SET      35.327       91.875
SET      36.351       92.500
SET      37.375       93.125
SET      38.911       93.750
SET      39.679       94.062
SET      40.447       94.375
SET      41.471       94.688
SET      42.495       95.000
SET      43.775       95.312
SET      45.055       95.625
SET      46.591       95.938
SET      48.127       96.250
SET      50.175       96.562
SET      52.479       96.875
SET      53.759       97.031
SET      55.551       97.188
SET      57.087       97.344
SET      59.135       97.500
SET      61.695       97.656
SET      63.999       97.812
SET      67.071       97.969
SET      70.143       98.125
SET      73.727       98.281
SET      77.823       98.438
SET      80.383       98.516
SET      82.431       98.594
SET      84.991       98.672
SET      87.551       98.750
SET      90.111       98.828
SET      92.671       98.906
SET      96.255       98.984
SET      99.327       99.062
SET     102.911       99.141
SET     106.495       99.219
SET     108.543       99.258
SET     110.591       99.297
SET     112.639       99.336
SET     115.199       99.375
SET     117.759       99.414
SET     120.319       99.453
SET     122.879       99.492
SET     125.951       99.531
SET     129.535       99.570
SET     133.119       99.609
SET     135.167       99.629
SET     137.215       99.648
SET     139.263       99.668
SET     140.287       99.688
SET     142.335       99.707
SET     144.383       99.727
SET     146.431       99.746
SET     148.479       99.766
SET     151.551       99.785
SET     154.623       99.805
SET     155.647       99.814
SET     157.695       99.824
SET     159.743       99.834
SET     161.791       99.844
SET     163.839       99.854
SET     165.887       99.863
SET     167.935       99.873
SET     169.983       99.883
SET     172.031       99.893
SET     175.103       99.902
SET     177.151       99.907
SET     179.199       99.912
SET     180.223       99.917
SET     181.247       99.922
SET     183.295       99.927
SET     185.343       99.932
SET     187.391       99.937
SET     189.439       99.941
SET     191.487       99.946
SET     194.559       99.951
SET     196.607       99.954
SET     198.655       99.956
SET     199.679       99.958
SET     200.703       99.961
SET     202.751       99.963
SET     203.775       99.966
SET     207.871       99.968
SET     209.919       99.971
SET     211.967       99.973
SET     216.063       99.976
SET     217.087       99.977
SET     218.111       99.978
SET     219.135       99.979
SET     221.183       99.980
SET     223.231       99.982
SET     224.255       99.983
SET     226.303       99.984
SET     228.351       99.985
SET     232.447       99.987
SET     234.495       99.988
SET     237.567       99.988
SET     240.639       99.989
SET     247.807       99.990
SET     252.927       99.990
SET     257.023       99.991
SET     259.071       99.991
SET     261.119       99.992
SET     264.191       99.993
SET     270.335       99.993
SET     274.431       99.994
SET     274.431       99.994
SET     276.479       99.995
SET     278.527       99.995
SET     284.671       99.995
SET     286.719       99.995
SET     290.815       99.996
SET     292.863       99.996
SET     294.911       99.996
SET     296.959       99.997
SET     311.295       99.997
SET     311.295       99.997
SET     313.343       99.997
SET     313.343       99.997
SET     313.343       99.998
SET     315.391       99.998
SET     317.439       99.998
SET     321.535       99.998
SET     325.631       99.998
SET     325.631       99.998
SET     325.631       99.998
SET     325.631       99.999
SET     331.775       99.999
SET     331.775       99.999
SET     331.775       99.999
[...]
SET     335.871       99.999
SET     335.871       99.999
SET     335.871       99.999
SET     339.967       99.999
SET     339.967       99.999
SET     339.967       99.999
[...]
SET     360.447      100.000
SET     360.447      100.000
SET     360.447      100.000
[...]
SET     362.495      100.000
SET     362.495      100.000
SET     362.495      100.000
[...]
SET     374.783      100.000
SET     374.783      100.000
---
GET       0.239        0.000
GET       2.863        5.000
GET       5.535       10.000
GET       7.423       15.000
GET       8.895       20.000
GET      10.047       25.000
GET      11.135       30.000
GET      12.159       35.000
GET      13.247       40.000
GET      14.335       45.000
GET      15.487       50.000
GET      16.063       52.500
GET      16.767       55.000
GET      17.407       57.500
GET      18.047       60.000
GET      18.815       62.500
GET      19.583       65.000
GET      20.351       67.500
GET      21.247       70.000
GET      22.015       72.500
GET      23.039       75.000
GET      23.551       76.250
GET      24.063       77.500
GET      24.703       78.750
GET      25.343       80.000
GET      25.983       81.250
GET      26.751       82.500
GET      27.519       83.750
GET      28.287       85.000
GET      29.183       86.250
GET      30.207       87.500
GET      30.719       88.125
GET      31.359       88.750
GET      31.999       89.375
GET      32.639       90.000
GET      33.535       90.625
GET      34.303       91.250
GET      35.327       91.875
GET      36.351       92.500
GET      37.631       93.125
GET      38.911       93.750
GET      39.679       94.062
GET      40.703       94.375
GET      41.727       94.688
GET      42.751       95.000
GET      43.775       95.312
GET      45.055       95.625
GET      46.591       95.938
GET      48.639       96.250
GET      50.431       96.562
GET      52.735       96.875
GET      54.271       97.031
GET      55.807       97.188
GET      57.599       97.344
GET      59.647       97.500
GET      61.951       97.656
GET      64.255       97.812
GET      67.071       97.969
GET      70.655       98.125
GET      74.239       98.281
GET      78.335       98.438
GET      80.383       98.516
GET      82.943       98.594
GET      84.991       98.672
GET      87.551       98.750
GET      90.623       98.828
GET      93.695       98.906
GET      96.255       98.984
GET      99.839       99.062
GET     103.423       99.141
GET     107.007       99.219
GET     109.055       99.258
GET     111.103       99.297
GET     113.151       99.336
GET     115.199       99.375
GET     117.759       99.414
GET     120.319       99.453
GET     122.879       99.492
GET     125.951       99.531
GET     129.023       99.570
GET     132.095       99.609
GET     134.143       99.629
GET     136.191       99.648
GET     138.239       99.668
GET     140.287       99.688
GET     142.335       99.707
GET     144.383       99.727
GET     146.431       99.746
GET     148.479       99.766
GET     150.527       99.785
GET     153.599       99.805
GET     155.647       99.814
GET     157.695       99.824
GET     159.743       99.834
GET     160.767       99.844
GET     162.815       99.854
GET     164.863       99.863
GET     166.911       99.873
GET     169.983       99.883
GET     172.031       99.893
GET     175.103       99.902
GET     177.151       99.907
GET     178.175       99.912
GET     180.223       99.917
GET     182.271       99.922
GET     183.295       99.927
GET     185.343       99.932
GET     188.415       99.937
GET     190.463       99.941
GET     192.511       99.946
GET     194.559       99.951
GET     195.583       99.954
GET     197.631       99.956
GET     198.655       99.958
GET     199.679       99.961
GET     200.703       99.963
GET     202.751       99.966
GET     204.799       99.968
GET     207.871       99.971
GET     210.943       99.973
GET     214.015       99.976
GET     216.063       99.977
GET     217.087       99.978
GET     219.135       99.979
GET     221.183       99.980
GET     222.207       99.982
GET     224.255       99.983
GET     225.279       99.984
GET     227.327       99.985
GET     228.351       99.987
GET     231.423       99.988
GET     232.447       99.988
GET     234.495       99.989
GET     235.519       99.990
GET     238.591       99.990
GET     242.687       99.991
GET     244.735       99.991
GET     248.831       99.992
GET     251.903       99.993
GET     257.023       99.993
GET     261.119       99.994
GET     264.191       99.994
GET     266.239       99.995
GET     268.287       99.995
GET     272.383       99.995
GET     274.431       99.995
GET     274.431       99.996
GET     274.431       99.996
GET     276.479       99.996
GET     280.575       99.997
GET     286.719       99.997
GET     288.767       99.997
GET     288.767       99.997
GET     290.815       99.997
GET     292.863       99.998
GET     294.911       99.998
GET     294.911       99.998
GET     296.959       99.998
GET     301.055       99.998
GET     303.103       99.998
GET     311.295       99.998
GET     311.295       99.999
GET     311.295       99.999
GET     313.343       99.999
GET     313.343       99.999
GET     313.343       99.999
GET     315.391       99.999
GET     315.391       99.999
GET     315.391       99.999
GET     317.439       99.999
GET     321.535       99.999
GET     321.535       99.999
GET     323.583       99.999
GET     325.631       99.999
GET     325.631       99.999
GET     327.679       99.999
GET     331.775       99.999
GET     331.775      100.000
GET     331.775      100.000
GET     331.775      100.000
GET     333.823      100.000
GET     333.823      100.000
GET     333.823      100.000
[...]
GET     335.871      100.000
GET     335.871      100.000
GET     335.871      100.000
[...]
GET     337.919      100.000
GET     337.919      100.000
GET     339.967      100.000
GET     339.967      100.000
GET     360.447      100.000
GET     360.447      100.000
GET     360.447      100.000
[...]
GET     362.495      100.000
GET     362.495      100.000
GET     362.495      100.000
[...]
GET     374.783      100.000
GET     374.783      100.000
---
WAIT      0.000      100.000